bog_app/app/controllers/creatures_controller.rb

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    creature_id = params[:id]
    @creature = Creature.find_by_id(creature_id)

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Rodents of Unusual Size"], ["description", "Large rats"], ["created_at", 2016-09-30 20:18:12 UTC], ["updated_at", 2016-09-30 20:18:12 UTC]]
---
  def create
    creature_params = params.require(:creature).permit(:name, :description)
    @creature = Creature.new(creature_params)
    if @creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def edit
    creature_id = params[:id]
    @creature = Creature.find_by_id(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "creatures" SET "description" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["description", "They smell worse and have red stripes on them"], ["updated_at", 2016-09-30 20:58:29 UTC], ["id", 9]]
---
  def update
    creature_id = params[:id]
    @creature = Creature.find_by_id(creature_id)
    creature_params = params.require(:creature).permit(:name, :description)
    @creature.update_attributes(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 9]]
---
  def destroy
    creature_id = params[:id]
    @creature = Creature.find_by_id(creature_id)
    @creature.destroy