bog_app/bog_app/app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Testing Again"], ["description", "More testing"], ["created_at", 2016-10-02 17:40:34 UTC], ["updated_at", 2016-10-02 17:40:34 UTC]]
---
  def create
    creature_params = params.require(:creature).permit(:name, :description)
    creature = Creature.new(creature_params)
    if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    creature_id = params[:id]
    @creature = Creature.find_by_id(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    creature_id = params[:id]
    @creature = Creature.find_by_id(creature_id)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "creatures" SET "name" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["name", "Darth Vader the Second"], ["updated_at", 2016-10-02 18:26:51 UTC], ["id", 5]]
---
  def update
    creature_id = params[:id]
    creature = Creature.find_by_id(creature_id)
    creature_params = params.require(:creature).permit(:name, :descrip)
    creature.update_attributes(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 5]]
---
  def destroy
    creature_id = params[:id]
    creature = Creature.find_by_id(creature_id)
    creature.destroy