bog_app/bog_app/bog_app/app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Rodents of Unusual Size"], ["description", "Large, nasty rats"], ["created_at", 2016-10-02 19:45:09 UTC], ["updated_at", 2016-10-02 19:45:09 UTC]]
---
  def create
    creature_params = params.require(:creature).permit(:name, :description)
    creature = Creature.new(creature_params)
    if creature.save

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    creature_params = params[:id]
    @creature = Creature.find_by_id(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def edit
    creature_params = params[:id]
    @creature = Creature.find_by_id(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "creatures" SET "name" = $1, "description" = $2, "updated_at" = $3 WHERE "creatures"."id" = $4  [["name", "Testing Yo Creature"], ["description", "yo yo yo"], ["updated_at", 2016-10-02 20:12:22 UTC], ["id", 9]]
---
  def update
    creature_id = params[:id]
    creature = Creature.find_by_id(creature_id)
    creature_params = params.require(:creature).permit(:name, :description)
    creature.update_attributes(creature_params)

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 8]]
---
  def destroy
    creature_id = params[:id]
    creature = Creature.find_by_id(creature_id)
    creature.destroy